## Statistik göstəricilərin yaradılması

In [2]:
import pandas as pd

In [6]:
data = pd.read_csv("C:/Users/tarlan.jabiyev/Desktop/datasets/demographics.csv")

In [8]:
data.head()

,age,marital,income,educ,carpr,carcat,gender,retired
0,55,Married,72,Did not complete high school,36.2,Luxury,Female,No
1,56,Unmarried,153,Did not complete high school,76.9,Luxury,Male,No
2,28,Married,28,Some college,13.7,Economy,Female,No
3,24,Married,26,College degree,12.5,Economy,Male,No
4,25,Unmarried,23,High school degree,11.3,Economy,Male,No

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 510 entries, 0 to 509
Data columns (total 8 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   age      510 non-null    int64
 1   marital  510 non-null    object
 2   income   510 non-null    int64
 3   educ     510 non-null    object
 4   carpr    510 non-null    float64
 5   carcat   510 non-null    object
 6   gender   510 non-null    object
 7   retired  510 non-null    object
dtypes: float64(1), int64(2), object(5)
memory usage: 32.0+ KB

In [11]:
# Aritmatik orta(mean)
data['income'].mean()

78.59411764705882

In [14]:
# standart sapma və variansın hesablanması
data['income'].std()

112.30544392622947

In [15]:
data['income'].var() #data['income'].std() ** 2

12612.512735467471

In [17]:
# minimum, maksimum və aralığın hesablanması
data['income'].min()

9

In [18]:
data['income'].max()

1116

In [19]:
data['income'].max() - data['income'].min()

1107

In [21]:
# median
data['income'].median()

45.0

In [26]:
# "scipy" və "statistics" paketləri

In [27]:
data.describe(include='all')

,age,marital,income,educ,carpr,carcat,gender,retired
count,510.000000,510,510.000000,510,510.000000,510,510,510
unique,NaN,2,NaN,5,NaN,3,2,2
top,NaN,Unmarried,NaN,High school degree,NaN,Luxury,Male,No
freq,NaN,256,NaN,132,NaN,190,260,485
mean,42.058824,NaN,78.594118,NaN,30.836667,NaN,NaN,NaN
std,12.428043,NaN,112.305444,NaN,22.067056,NaN,NaN,NaN
min,18.000000,NaN,9.000000,NaN,4.400000,NaN,NaN,NaN
25%,32.000000,NaN,28.000000,NaN,13.825000,NaN,NaN,NaN
50%,41.000000,NaN,45.000000,NaN,22.200000,NaN,NaN,NaN
75%,51.000000,NaN,86.000000,NaN,42.425000,NaN,NaN,NaN
max,73.000000,NaN,1116.000000,NaN,98.600000,NaN,NaN,NaN

In [28]:
from scipy import stats
stats.describe(data['income'])

DescribeResult(nobs=510, minmax=(9, 1116), mean=78.59411764705882, variance=12612.512735467468, skewness=5.509270256908631, kurtosis=40.4816802038627)

## Skewness və Kurtosis müəyyənləşdirilməsi

In [29]:
from scipy.stats import skew, kurtosis

skew(data['income'])

5.509270256908631

In [36]:
kurtosis(data['income'])

40.4816802038627

In [37]:
# Quantiles hesablanması
data['income'].quantile([0.05, 0.5, 0.95])

0.05     16.0
0.50     45.0
0.95    241.1
Name: income, dtype: float64

In [41]:
# Mode'un tapılması
data['income'].mode()

0    28
Name: income, dtype: int64

In [42]:
from statistics import mode
from scipy.stats import mode as scipy_mode

In [43]:
scipy_mode(data['income'], keepdims=True)

ModeResult(mode=array([28], dtype=int64), count=array([14], dtype=int64))

## Qrup üzrə statistik göstəricilərin əldə edilməsi

In [51]:
data.groupby('marital')['age'].agg(['mean', 'std', 'median', 'var'])

                mean        std  median         var
marital
Married    42.023622  12.005246    41.0  144.125922
Unmarried  42.093750  12.857248    41.0  165.308824

In [52]:
data.groupby(['marital', 'gender'])['age'].mean()

marital    gender
Married    Female    41.302326
           Male      42.768000
Unmarried  Female    42.545455
           Male      41.688889
Name: age, dtype: float64